app/controllers/pictures_controller.rb

  def index # method from the model -- active record
    @pictures = Picture.all
---
SELECT "pictures".* FROM "pictures" WHERE (created_at < '2017-09-18 15:28:00.161813') AND (created_at >= '2017-09-18 15:28:00.161813')

  def show
    @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @picture = Picture.new
    @picture.title = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url = params[:picture][:url]

    if @picture.save
---
INSERT INTO "pictures" ("artist", "title", "url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)

  def edit
    @picture = Picture.find(params[:id])
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    @picture = Picture.find(params[:id])
    @picture.title = params[:picture][:title]
    @picture.artist = params[:picture][:artist]
    @picture.url = params[:picture][:url]

    if @picture.save
---
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pictures" SET "artist" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["artist", "Sergey Ershov"], ["updated_at", "2017-10-18 00:02:57.315639"], ["id", 1]]